<a href="https://colab.research.google.com/github/barkle2/Programming/blob/master/%5BPython%5D%20Pandas/Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
## DataFrame의 개념

In [1]:
import pandas as pd

In [2]:
# csv 파일 읽어서 DataFrame 만들기
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Pandas/friends.csv')

In [3]:
# DataFrame의 타입
type(df)

pandas.core.frame.DataFrame

In [4]:
# DataFrame의 컬럼은 Series / DataFrame은 Series의 결합체
print(type(df.name))
print(type(df.age))
print(type(df.job))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [5]:
# Series는 List로 만들 수 있다.
s1 = pd.core.series.Series( [1,2,3] )
s2 = pd.core.series.Series( ['one', 'two', 'three'] )

In [6]:
# Series가 있으면 DataFrame을 만들 수 있다.
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

## 파일 읽어서 DataFrame 만들기

In [7]:
# csv 파일 읽어서 DataFrame 만들기
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Pandas/friends.csv')

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
# DataFrame 앞부분 데이터 보기
df.head() # 입력값이 없으면 5개 보여줌

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [10]:
# DataFrame 뒷부분 데이터 보기
df.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [11]:
# 쉼표로 구분된 txt 파일은 read_csv로 읽을 수 있다.
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Pandas/friends.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [12]:
# tab으로 구분된 txt 파일을 읽으려면
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Pandas/friends_tab.txt',
                 delimiter='\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
# 헤더가 없는 csv 파일을 읽으려면
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Pandas/friends_nohead.csv',
                 header=None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [14]:
# 컬럼 이름 입력하기
df.columns=['name', 'age', 'job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## Python code로 DataFrame 만들기

In [15]:
# 우선 List를 만든다.
friend_dict_list = [
  {'name': 'John', 'age':25, 'job': 'student'},
  {'name': 'Nate', 'age':30, 'job': 'teacher'}
]

In [16]:
# List로 DataFrame을 만든다.
df = pd.DataFrame(friend_dict_list)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [17]:
# DataFrame 컬럼 순서 바꾸기
df = df[['age', 'name', 'job']]
df

   age  name      job
0   25  John  student
1   30  Nate  teacher

In [18]:
# Records_List와 Column_List로 DataFrame 만들기
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns=column_name)
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

## DataFrame 파일로 저장하기

In [19]:
# csv 파일로 저장하기
df.to_csv('friends.csv')

In [ ]:
# csv 파일로 저장하기(옵션 추가)
df.to_csv('friends.csv', index=False, header=False, na_rep='-')

### Colab에서 Local File Upload, Download 하기

In [21]:
# 로컬 파일 불러오기
from google.colab import files

uploaded = files.upload()

for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(name=fn, length=len(uploaded[fn])))

Saving friends_tab.txt to friends_tab.txt
User uploaded file "friends_tab.txt" with length 114 bytes

In [23]:
# 생성한 파일 다운로드하기
files.download('friends.csv')